[{"title":"Lufthansa still considering protection from creditors: company source","source":"Reuters","description":"The idea of German flagship carrier Lufthansa using a type of protection from creditors is not yet off the table, a source at the airline said on Tuesday.","url":"https://www.reuters.com/article/us-health-coronavirus-lufthansa-idUSKCN22A1EU","urlToImage":"https://s4.reutersmedia.net/resources/r/?m=02&d=20200428&t=2&i=1516710611&w=1200&r=LYNXNPEG3R0T9"},{"title":"U.S. journalist Daniel Pearl's parents challenge freeing of his convicted killers","source":"Reuters","description":"Slain U.S. journalist Daniel Pearl's parents have petitioned to the Pakistani Supreme Court seeking to overturn a ruling that freed four men who had been convicted in 2002 of involvement in his killing, their lawyer said on Saturday.","url":"https://www.reuters.com/article/us-pakistan-court-danielpearl-idUSKBN22E0L1","urlToImage":"https://s2.reutersmedia.net/resources/r/?m=02&d=20200502&t=2&i=1517256280&w=1200&r=LYNXMPEG410ED"},{"title":"U.S. Supreme Court rules for insurers over $12 billion Obamacare claims","source":"Reuters","description":"The U.S. Supreme Court on Monday ruled in favor of health insurers seeking $12 billion from the federal government under a program set up by the Obamacare law aimed at encouraging them to offer medical coverage to previously uninsured Americans.","url":"https://www.reuters.com/article/us-usa-court-obamacare-idUSKCN2291Y3","urlToImage":"https://s1.reutersmedia.net/resources/r/?m=02&d=20200427&t=2&i=1516599059&w=1200&r=LYNXNPEG3Q1BA"},{"title":"Britain ready to support Rolls-Royce employees over job cuts","source":"Reuters","description":"Britain's government stands ready to help those affected by a plan at engine maker Rolls-Royce to cut at least 9,000 jobs, a spokesman for Prime Minister Boris Johnson said on Wednesday.","url":"https://www.reuters.com/article/us-health-coronavirus-britain-rolls-royc-idUSKBN22W21N","urlToImage":"https://s2.reutersmedia.net/resources/r/?m=02&d=20200520&t=2&i=1519304005&w=1200&r=LYNXMPEG4J18F"},{"title":"China says Pompeo's congratulations to Taiwan seriously damaged relations","source":"Reuters","description":"China's foreign ministry said on Wednesday U.S. Secretary of State Mike Pompeo seriously damaged the peace and stability of the Taiwan Strait and China-U.S. relations by making a congratulatory statement to Taiwan's president Tsai Ing-Wen.","url":"https://www.reuters.com/article/us-taiwan-president-inauguration-usa-idUSKBN22W0UL","urlToImage":"https://s4.reutersmedia.net/resources_v2/images/rcom-default.png"},{"title":"KCNA reports North Korea leader Kim Jong Un resuming public activity","source":"Reuters","description":"North Korea's state news agency KCNA said on Saturday leader Kim Jong Un attended the completion of a fertilizer plant in a region north of the capital, Pyongyang, in the first report of his public activity since April 11.","url":"https://www.reuters.com/article/us-north-korea-leader-idUSKBN22D6DD","urlToImage":"https://s3.reutersmedia.net/resources/r/?m=02&d=20200501&t=2&i=1517204352&w=1200&r=LYNXMPEG4046P"},{"title":"U.S. Soccer scores victory in equal pay suit with women's team players","source":"Reuters","description":"The U.S. women's soccer team's claims for equal pay were dismissed by a court on Friday, handing a victory to the United States Soccer Federation.","url":"https://www.reuters.com/article/us-soccer-usa-women-lawsuit-idUSKBN22E003","urlToImage":"https://s4.reutersmedia.net/resources_v2/images/rcom-default.png"},{"title":"Futures pare gains after data shows record job losses","source":"Reuters","description":"U.S. stocks futures pared gains after ADP's report showed the private sector lost a record 20 million jobs in April.","url":"http://feeds.reuters.com/~r/reuters/topNews/~3/ClxMxd3Fj78/futures-pare-gains-after-data-shows-record-job-losses-idUSKBN22I1II","urlToImage":null},{"title":"UK tells the EU to budge on free trade deal: Gove says","source":"Reuters","description":"The United Kingdom wants a Brexit free trade deal but there are significant differences with the European Union because it does not seem to understand that it is negotiating with a sovereign state, senior British minister Michael Gove said on Tuesday.","url":"https://www.reuters.com/article/us-britain-eu-gove-idUSKBN22V1TS","urlToImage":"https://s2.reutersmedia.net/resources/r/?m=02&d=20200519&t=2&i=1519157541&w=1200&r=LYNXMPEG4I13C"},{"title":"Lori Loughlin, other parents lose bid to dismiss U.S. college scam charges","source":"Reuters","description":"A federal judge on Friday declined to dismiss the charges against \"Full House\" actress Lori Loughlin and other wealthy parents awaiting trial in the U.S. college admissions scandal after they accused investigators of fabricating evidence.","url":"https://www.reuters.com/article/us-usa-education-cheating-idUSKBN22K2KM","urlToImage":"https://s3.reutersmedia.net/resources/r/?m=02&d=20200508&t=2&i=1517977848&w=1200&r=LYNXMPEG471O5"},{"title":"Britain won't quarantine travellers from France at this stage","source":"Reuters","description":"Britain won't impose quarantine to travellers coming from France at this stage, France and Britain said on Sunday, with the two countries adding that any such measure would be reciprocal and only be imposed after mutual consultation.","url":"https://www.reuters.com/article/us-health-coronavirus-britain-france-idUSKBN22M0P8","urlToImage":"https://s2.reutersmedia.net/resources/r/?m=02&d=20200510&t=2&i=1518115067&w=1200&r=LYNXMPEG490IB"},{"title":"Justice Department probe sought for slaying of unarmed black man in Georgia","source":"Reuters","description":"Georgia's attorney general asked federal prosecutors on Sunday to investigate local law enforcement's response to the fatal shooting of an unarmed black man who authorities say was slain by a white ex-police officer and his son as the victim jogged through a …","url":"https://www.reuters.com/article/us-shooting-georgia-idUSKBN22N07O","urlToImage":"https://s2.reutersmedia.net/resources/r/?m=02&d=20200511&t=2&i=1518140762&w=1200&r=LYNXMPEG4A05F"},{"title":"London commute is going to be very different, transport operator says","source":"Reuters","description":"London's commute will be very different when people start to go back to work as demand on buses and the underground railway will be reduced by 85%, the city transport operator said.","url":"https://www.reuters.com/article/us-health-coronavirus-britain-transport-idUSKBN22N1JP","urlToImage":"https://s3.reutersmedia.net/resources/r/?m=02&d=20200511&t=2&i=1518192173&w=1200&r=LYNXMPEG4A146"},{"title":"'He wouldn't say a word' - Rwanda genocide fugitive lived incognito in Paris","source":"Reuters","description":"Rwandan genocide fugitive Felicien Kabuga, whose arrest on Saturday ended 26 years on the run, was a frail, elderly man who said little to neighbours and who would take a stroll most days outside of his apartment in a well-off suburb of Paris.","url":"https://www.reuters.com/article/us-france-rwanda-arrest-neighbours-idUSKBN22T0RE","urlToImage":"https://s4.reutersmedia.net/resources/r/?m=02&d=20200517&t=2&i=1518936399&w=1200&r=LYNXMPEG4G0R9"},{"title":"Beijing, on HK, says no country would let separatists endanger security","source":"Reuters","description":"China said on Friday it opposed foreign interference in Hong Kong and that no country would allow separatists to endanger national security, responding to the latest U.S. criticisms about Beijing's handling of the city.","url":"https://www.reuters.com/article/us-hongkong-protets-china-mofa-idUSKBN22Y0Z0","urlToImage":"https://s2.reutersmedia.net/resources/r/?m=02&d=20200522&t=2&i=1519544297&w=1200&r=LYNXMPEG4L0L4"},{"title":"Hong Kong leader expects pro-democracy protests to continue","source":"Reuters","description":"Hong Kong leader Carrie Lam said on Friday she did not expect pro-democracy protests that have been taking place since June last year to end, even as the central government in Beijing announced plans to introduce national security legislation.","url":"https://www.reuters.com/article/us-hongkong-protests-carrielam-idUSKBN22Y1VR","urlToImage":"https://s2.reutersmedia.net/resources/r/?m=02&d=20200522&t=2&i=1519580654&w=1200&r=LYNXMPEG4L1B3"},{"title":"Exclusive: Pentagon halts rare earths funding for Lynas, MP Materials - document, sources","source":"Reuters","description":"The U.S. Department of Defense has reversed its decision to fund two projects to process rare earth minerals for military weapons, one of which has controversial ties to China, according to three sources and a government document seen by Reuters.","url":"https://www.reuters.com/article/us-usa-rareearths-exclusive-idUSKBN22Y1VC","urlToImage":"https://s4.reutersmedia.net/resources/r/?m=02&d=20200522&t=2&i=1519582739&w=1200&r=LYNXMPEG4L1AX"},{"title":"White House adviser: China's Hong Kong move will hurt its economy","source":"Reuters","description":"White House economic adviser Kevin Hassett on Friday said Beijing's move to impose a new security law on Hong Kong after last year's pro-democracy unrest would harm the Chinese economy, and warned that Washington could take action in response to the move.","url":"https://www.reuters.com/article/us-china-parliament-hongkong-whitehouse-idUSKBN22Y28O","urlToImage":"https://s3.reutersmedia.net/resources/r/?m=02&d=20200522&t=2&i=1519595963&w=1200&r=LYNXMPEG4L1JM"},{"title":"Karachi hospitals receive at least 56 bodies from plane crash site: hospital officials","source":"Reuters","description":"Karachi hospitals received 56 bodies from the site of a commercial jet that crashed into a residential neighbourhood while landing in Pakistan's largest city, hospital officials said on Friday.","url":"https://www.reuters.com/article/us-pakistan-airline-crash-hospital-idUSKBN22Y2KU","urlToImage":"https://s3.reutersmedia.net/resources/r/?m=02&d=20200522&t=2&i=1519612423&w=1200&r=LYNXMPEG4L1RO"},{"title":"Hong Kong police fire tear gas to disperse anti-government protesters","source":"Reuters","description":"Hong Kong police fired tear gas to disperse anti-government protesters on Sunday, as thousands thronged the streets to protest against Beijing’s plan to directly impose national security laws on the city.","url":"https://www.reuters.com/article/us-hongkong-protests-teargas-idUSKBN23005I","urlToImage":"https://s4.reutersmedia.net/resources/r/?m=02&d=20200524&t=2&i=1519715296&w=1200&r=LYNXMPEG4N03W"}]